### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [7]:
import pandas as pd
data = [4,8,15,16,23,42]
data_series=pd.Series(data)
print(data_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
lst = [1,2,3,4,5,6,7,8,9,10]
lst_series = pd.Series(lst)
print(lst_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:
'Name':'Alice','Bob','Claire' 
'Age':25,30,27
'Gender':'Female','Male','Female'
 Then, print the DataFrame.

In [11]:
data = {'Name':['Alice','Bob','Claire'], 
       'Age':[25,30,27],
       'Gender': ['Female','Male','Female']}

data_var = pd.DataFrame(data)
print(data_var)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a Dataframe is a two-dimentional tabular data structure with labeled rows and columns.
it can be thought of as a collection of Pandas Series objects , where each column of the DataFrame is a seperate Series.
On the other hand , a Pandas Series is a one - dimentional array - like that can hold any data type, such as integers, floats, strings, and even other objects.
it has an index that labels each element of the series

In [24]:
import pandas as pd

# create a Pandas Series
series = pd.Series([5,6,7,8,9], name='my_series')

# Create a dataframe from the series
df = pd.DataFrame({'num':[1,2,3,4,5],
                  'alpha':['a','b','c','d','e'],
                  'series':series})

# print the Series and DataFrame
print('Series:')
print(series)
print('\nDataFrame:')
print(df)

Series:
0    5
1    6
2    7
3    8
4    9
Name: my_series, dtype: int64

DataFrame:
   num alpha  series
0    1     a       5
1    2     b       6
2    3     c       7
3    4     d       8
4    5     e       9

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [28]:
data = {'Name':['abc', 'def', 'ijk'],
       'Age':[20,22,24], 
       'branch':['Mechanical', 'Civil', 'Computer Science']}
data_store = pd.DataFrame(data)
print(data_store)

  Name  Age            branch
0  abc   20        Mechanical
1  def   22             Civil
2  ijk   24  Computer Science

In [31]:
data_store.head()

  Name  Age            branch
0  abc   20        Mechanical
1  def   22             Civil
2  ijk   24  Computer Science

In [33]:
data_store.tail()

  Name  Age            branch
0  abc   20        Mechanical
1  def   22             Civil
2  ijk   24  Computer Science

In [34]:
data_store.describe()

        Age
count   3.0
mean   22.0
std     2.0
min    20.0
25%    21.0
50%    22.0
75%    23.0
max    24.0

In [39]:
data_store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   branch  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [42]:
data_store.columns

Index(['Name', 'Age', 'branch'], dtype='object')

In [43]:
data_store.dtypes

Name      object
Age        int64
branch    object
dtype: object

In [44]:
data_store[['Name','Age']]

  Name  Age
0  abc   20
1  def   22
2  ijk   24

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable in nature, meaning that their values can be changed after they have been created. Panel, on the other hand, is deprecated and has been replaced by the more versatile MultiIndex.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [45]:
# create a series
name = pd.Series(['Alice','Bob', 'Charlie'])
age = pd.Series([20,25,30])
city = pd.Series(['New York', 'London', 'USA'])

# create a dictionary of the series
data ={'Name':name , 'Age':age , 'City':city}

# create dataframe from the dictionary
df= pd.DataFrame(data)
# display the resulting DataFrame
print(df)

      Name  Age      City
0    Alice   20  New York
1      Bob   25    London
2  Charlie   30       USA